#http://president.am/hy/constitution-2015/
text="Հայաստանի Հանրապետության տնտեսական կարգի հիմքը սոցիալական շուկայական տնտեսությունն է, որը հիմնված է մասնավոր սեփականության, տնտեսական գործունեության ազատության, ազատ տնտեսական մրցակցության վրա և պետական քաղաքականության միջոցով ուղղված է ընդհանուր տնտեսական բարեկեցությանը և սոցիալական արդարությանը։"

scriptname0=`basename "$0"`
scriptname="${scriptname0%.*}"


speed=100
lang=hy
#lang=hy-west

echo $text | espeak -s $speed  -w ${scriptname}_${speed}_wpm.wav -v $lang
