#http://www.arlis.am/DocumentView.aspx?DocID=120808
text="3. Ավագանու նիստն իրավազոր է, եթե նիստին ներկա է ավագանու անդամների՝ օրենքով սահմանված թվի կեսից ավելին: Եթե կես ժամվա ընթացքում նիստին չի ներկայանում քաղաքապետը կամ նրա առաջին տեղակալը, ապա նիստը վարողի չներկայանալու մասին կազմվում է արձանագրություն, որն ստորագրում են ավագանու նիստին ներկայացած անդամները, որից հետո նիստը վարում է ավագանու նիստին ներկա տարիքով ավագ անդամը։"


scriptname0=`basename "$0"`
scriptname="${scriptname0%.*}"


speed=100
lang=hy
#lang=hy-west

echo $text | espeak -s $speed  -w ${scriptname}_${speed}_wpm.wav -v $lang
